In [2]:
import requests
import pandas as pd

def getDataCentral(path, filename, ext = ".xls"):
    '''
    Funcion para descargar data del Banco central
    
    path: ruta del documento a descargar
    filename: nombre del archivo a grabar la data descargada
    ext: la extencion del archivo. Por lo general los del banco central son '.xls' 
    
    TODO: Falta poner que se descarguen en la carpeta de data
    
    '''
    resp = requests.get(path)
    
    with open(filename + ext, "wb") as output:
        output.write(resp.content)

In [3]:
documentos = {"PIB": "https://gdc.bancentral.gov.do/Common/public/estad%C3%ADsticas/sector-real/documents/pib_gasto_2007.xls",
              "IPC": "https://gdc.bancentral.gov.do/Common/public/estad%C3%ADsticas/precios/documents/ipc_base_2010.xls",
              "TPM": "https://gdc.bancentral.gov.do/Common/public/estad%C3%ADsticas/sector-monetario-y-financiero/documents/Serie_TPM.xlsx",
              "tasa_dolar": "https://gdc.bancentral.gov.do/Common/public/estad%C3%ADsticas/mercado-cambiario//documents//TASA_DOLAR_REFERENCIA_MC.XLS",
              "tasa_cambio_todas": "https://gdc.bancentral.gov.do/Common/public/estad%C3%ADsticas/mercado-cambiario//documents//TASAS_CONVERTIBLES_OTRAS_MONEDAS.xls",
              "agregados_monetarios": "https://gdc.bancentral.gov.do/Common/public/estad%C3%ADsticas/sector-monetario-y-financiero/documents/agregados_monetarios.xls",
              "reservas_internacionales": "https://gdc.bancentral.gov.do/Common/public/estad%C3%ADsticas/sector-externo/documents/reservas_internacionales.xls"}

In [8]:
for filename, path in documentos.items():
    getDataCentral(path, filename)

In [52]:
# TODO : completar la columna de periodo
nombres_ipc = ["periodo", "mes", "indice", "var_menusal", "var_dic","var_12_meses", "promedio"]
ipc = pd.read_excel("IPC.xls", skiprows = 5, names = nombres_ipc, usecols = [0, 1, 2, 3, 4, 5, 6], skipfooter = 1)

ipc.dropna(how = "all").head()

  periodo      mes    indice  var_menusal   var_dic  var_12_meses  promedio
1    1984    Enero  1.874175     1.736466  1.736466      7.053607  5.570878
2     NaN  Febrero  1.926862     2.811245  4.596527     11.183496  6.007967
3     NaN    Marzo  1.950619     1.232910  5.886108     11.916329  6.516152
4     NaN    Abril  1.981197     1.567587  7.545965     14.879978  7.359019
5     NaN     Mayo  2.004953     1.199098  8.835546     15.220330  8.260218

In [51]:
# TODO : completar la columna de periodo

nombres_tpm = ["periodo", "Mes", "tasa_politica","facilidades_depositos", "facilidades_prestamo", "facilidades_lombarda"]

tpm = pd.read_excel("TPM.xls",skiprows = 5, names = nombres_tpm, skipfooter = 1)

tpm.head()

,periodo,Mes,tasa_politica,facilidades_depositos,facilidades_prestamo,facilidades_lombarda
0,2004.0,Ene,0.45,0.45,NaN,0.55
1,NaN,Feb,0.50,0.50,NaN,0.60
2,NaN,Mar,0.50,0.50,NaN,0.60
3,NaN,Abr,0.50,0.50,NaN,0.60
4,NaN,May,0.15,0.15,NaN,0.60

In [50]:
# Se pueden buscar las siglas para que sea mas facil

tasas_todas = pd.read_excel("tasa_cambio_todas.xls", skiprows = 2)

tasas.tail()

,Año,Mes,Día,REAL BRASILENO,DOLAR CANADIENSE,FRANCO SUIZO,YUAN CHINO,DERECHO ESPECIAL DE GIRO,CORONA DANESA,EURO,LIBRA ESTERLINA,YEN JAPONES,CORONA NORUEGA,LIBRA ESCOCESA,CORONA SUECA,DOLAR ESTADOUNIDENSE,BOLIVAR FUERTE VENEZOLANO
3638,2018,Jul,4,12.6828,37.5628,49.6817,7.4064,69.4100,7.7271,57.5712,65.0829,0.4446,6.0822,65.0829,5.5326,49.3538,4.9416
3639,2018,Jul,5,12.6003,37.6019,49.7513,7.4343,69.5636,7.7596,57.8140,65.3956,0.4473,6.1237,65.3956,5.6453,49.3757,4.9438
3640,2018,Jul,6,12.5821,37.7011,49.7506,7.4271,69.6143,7.7703,57.9106,65.3766,0.4462,6.1330,65.3766,5.6369,49.3949,4.9457
3641,2018,Jul,9,12.5869,37.6715,49.7696,7.4642,69.8602,7.7732,58.2538,65.8833,0.4473,6.1353,65.8833,5.6390,49.4137,4.9476
3642,2018,Jul,10,12.5929,37.6952,49.7932,7.4714,69.6485,7.7769,57.9058,65.4178,0.4454,6.1382,65.4178,5.6417,49.4372,4.9499

In [56]:
tasa_dolar = pd.read_excel("tasa_dolar.xls", skiprows = 2)

tasa_dolar.head()

    Año  Mes  Día  Compra  Venta
0  1991  Ene    2    11.2   11.5
1  1991  Ene    3    11.2   11.5
2  1991  Ene    4    11.2   11.5
3  1991  Ene    7    11.2   11.5
4  1991  Ene    8    11.2   11.5

In [68]:
nombre_agregados = ["ano","mes","billetes_monedas","depositos_transferibles"]
agregados_monetarios = pd.read_excel("agregados_monetarios.xls", skiprows = 11, usecols = [0,1,2,3], names = nombre_agregados, skipfooter = 4)

agregados_monetarios.dropna(how = "all").tail()

      ano  mes  billetes_monedas  depositos_transferibles
193  2018  Ene      93329.691271            242217.713717
194  2018  Feb      94292.598792            237126.341753
195  2018  Mar      99926.392830            242280.574225
196  2018  Abr      97296.655428            241488.629921
197  2018  May      97498.982676            241170.447404